Tekla Open API Reference for Tekla Structures 2025
RebarSetAddition Properties
The RebarSetAddition type exposes the following members.
Properties
Name | Description
Father
 Gets or sets the RebarSet to which the rebar set addition applies.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LegFaces
 Gets or sets the rebar set addition's RebarLegFace objects.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Top
See Also
Reference
RebarSetAddition Class
Tekla.Structures.Model Namespace